work/solution/chrome-download-attachment-issue.org
#+title ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_DISPOSITION
#+author iiCodeThings
#+date 2022-03-04

* Question description
在使用Flask框架做WebApp时，有个导出订单电子表格的需求，一开始实现方式如下：
+ 当收到导出request的时候生成订单电子表格文件
+ 将电子表格文件存放到Flask的static目录里面
+ 使用访问Flask静态文件的方式实现下载文件
** 参考代码
#+begin_src python
  @admin_blueprint.route('/order/export', methods=['GET'])
  @login_required
  def admin_order_export():
      return redirect(url_for('static', filename='订单.xls'))
#+end_src

在使用Chrome下载时回报如title所示的错误。
* 问题分析
*** 来自互联网的一种解释：
#+begin_quote
使用谷歌浏览器下载文件名中带有英文半角逗号的文件时，请求已发送，但响应时发生浏览器崩溃现象，
页面提示 ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_DISPOSITION ，其他浏览器无此现象，
查到是谷歌浏览器特有现象，应该说是一个bug，服务器端函数响应中若设置了 content-disposition http头，
需要确保filename参数使用双引号包裹。有时 filename* 参数也需要使用双引号括起.
#+end_quote
*** 实际分析结果
在flask这个环境下，即使附件文件名里面没有特殊字符也会报如标题所示的错误。需要进一步分析～
* Resolve solution
参考解决代码：
#+begin_src python
  from flask import send_from_directory
  return send_from_directory('/data/miniapp_store', 'orders.xls', as_attachment=True)
#+end_src

#+begin_center
© 2021-2022 road-trip.cc [[https://beian.miit.gov.cn/][京ICP备2022005336号-1]]
#+end_center
