work/solution/chrome-download-attachment-issue.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-04 Fri 11:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Yunchao Chen" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org95d8ea9">1. Question description</a>
<ul>
<li><a href="#orgfee5aae">1.1. 参考代码</a></li>
</ul>
</li>
<li><a href="#orga12608e">2. 问题分析</a>
<ul>
<li>
<ul>
<li><a href="#org7c36250">2.0.1. 来自互联网的一种解释：</a></li>
<li><a href="#org86b61ef">2.0.2. 实际分析结果</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org51f748e">3. Resolve solution</a></li>
</ul>
</div>
</div>
<p>
#+title ERR<sub>RESPONSE</sub><sub>HEADERS</sub><sub>MULTIPLE</sub><sub>CONTENT</sub><sub>DISPOSITION</sub>
#+author iiCodeThings
#+date 2022-03-04
</p>

<div id="outline-container-org95d8ea9" class="outline-2">
<h2 id="org95d8ea9"><span class="section-number-2">1.</span> Question description</h2>
<div class="outline-text-2" id="text-1">
<p>
在使用Flask框架做WebApp时，有个导出订单电子表格的需求，一开始实现方式如下：
</p>
<ul class="org-ul">
<li>当收到导出request的时候生成订单电子表格文件</li>
<li>将电子表格文件存放到Flask的static目录里面</li>
<li>使用访问Flask静态文件的方式实现下载文件</li>
</ul>
</div>
<div id="outline-container-orgfee5aae" class="outline-3">
<h3 id="orgfee5aae"><span class="section-number-3">1.1.</span> 参考代码</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ce537a; font-weight: bold;">@admin_blueprint.route</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/order/export'</span>, methods=<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">'GET'</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
<span style="color: #ce537a; font-weight: bold;">@login_required</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">admin_order_export</span><span style="color: #4f97d7;">()</span>:
    <span style="color: #4f97d7; font-weight: bold;">return</span> redirect<span style="color: #4f97d7;">(</span>url_for<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'static'</span>, filename=<span style="color: #2d9574;">'&#35746;&#21333;.xls'</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
在使用Chrome下载时回报如title所示的错误。
</p>
</div>
</div>
</div>
<div id="outline-container-orga12608e" class="outline-2">
<h2 id="orga12608e"><span class="section-number-2">2.</span> 问题分析</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7c36250" class="outline-4">
<h4 id="org7c36250"><span class="section-number-4">2.0.1.</span> 来自互联网的一种解释：</h4>
<div class="outline-text-4" id="text-2-0-1">
<blockquote>
<p>
使用谷歌浏览器下载文件名中带有英文半角逗号的文件时，请求已发送，但响应时发生浏览器崩溃现象，
页面提示 ERR<sub>RESPONSE</sub><sub>HEADERS</sub><sub>MULTIPLE</sub><sub>CONTENT</sub><sub>DISPOSITION</sub> ，其他浏览器无此现象，
查到是谷歌浏览器特有现象，应该说是一个bug，服务器端函数响应中若设置了 content-disposition http头，
需要确保filename参数使用双引号包裹。有时 filename* 参数也需要使用双引号括起.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org86b61ef" class="outline-4">
<h4 id="org86b61ef"><span class="section-number-4">2.0.2.</span> 实际分析结果</h4>
<div class="outline-text-4" id="text-2-0-2">
<p>
在flask这个环境下，即使附件文件名里面没有特殊字符也会报如标题所示的错误。需要进一步分析～
</p>
</div>
</div>
</div>
<div id="outline-container-org51f748e" class="outline-2">
<h2 id="org51f748e"><span class="section-number-2">3.</span> Resolve solution</h2>
<div class="outline-text-2" id="text-3">
<p>
参考解决代码：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> flask <span style="color: #4f97d7; font-weight: bold;">import</span> send_from_directory
<span style="color: #4f97d7; font-weight: bold;">return</span> send_from_directory<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/data/miniapp_store'</span>, <span style="color: #2d9574;">'orders.xls'</span>, as_attachment=<span style="color: #a45bad;">True</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="org-center">
<p>
© 2021-2022 road-trip.cc <a href="https://beian.miit.gov.cn/">京ICP备2022005336号-1</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yunchao Chen</p>
<p class="date">Created: 2022-03-04 Fri 11:45</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
